## Staging: lambdas
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

```terraform
Plan: 62 to add, 0 to change, 0 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |                                       NAME                                        |
|--------|-----------------------------------------------------------------------------------|
| add    | `aws_cloudwatch_event_rule.cron_2am_every_day`                                    |
|        | `aws_cloudwatch_event_rule.cron_3am_every_day`                                    |
|        | `aws_cloudwatch_event_rule.cron_4am_every_day`                                    |
|        | `aws_cloudwatch_event_rule.cron_5am_every_business_day`                           |
|        | `aws_cloudwatch_event_target.run_archive_form_responses_lambda_every_day`         |
|        | `aws_cloudwatch_event_target.run_archive_form_templates_lambda_every_day`         |
|        | `aws_cloudwatch_event_target.run_dead_letter_queue_consumer_lambda_every_day`     |
|        | `aws_cloudwatch_event_target.run_nagware_lambda_every_day`                        |
|        | `aws_cloudwatch_log_group.archive_form_templates`                                 |
|        | `aws_cloudwatch_log_group.audit_logs`                                             |
|        | `aws_cloudwatch_log_group.dead_letter_queue_consumer`                             |
|        | `aws_cloudwatch_log_group.nagware`                                                |
|        | `aws_cloudwatch_log_group.reliability`                                            |
|        | `aws_cloudwatch_log_group.response_archiver`                                      |
|        | `aws_cloudwatch_log_group.submission`                                             |
|        | `aws_cloudwatch_log_group.vault_integrity`                                        |
|        | `aws_iam_policy.lambda_dynamodb`                                                  |
|        | `aws_iam_policy.lambda_kms`                                                       |
|        | `aws_iam_policy.lambda_logging`                                                   |
|        | `aws_iam_policy.lambda_rds`                                                       |
|        | `aws_iam_policy.lambda_s3`                                                        |
|        | `aws_iam_policy.lambda_secrets`                                                   |
|        | `aws_iam_policy.lambda_sns`                                                       |
|        | `aws_iam_policy.lambda_sqs`                                                       |
|        | `aws_iam_role.lambda`                                                             |
|        | `aws_iam_role_policy_attachment.AWSLambdaVPCAccessExecutionRole`                  |
|        | `aws_iam_role_policy_attachment.lambda_dynamodb`                                  |
|        | `aws_iam_role_policy_attachment.lambda_kms`                                       |
|        | `aws_iam_role_policy_attachment.lambda_logs`                                      |
|        | `aws_iam_role_policy_attachment.lambda_rds`                                       |
|        | `aws_iam_role_policy_attachment.lambda_s3`                                        |
|        | `aws_iam_role_policy_attachment.lambda_secrets`                                   |
|        | `aws_iam_role_policy_attachment.lambda_sns`                                       |
|        | `aws_iam_role_policy_attachment.lambda_sqs`                                       |
|        | `aws_lambda_code_signing_config.lambda_code_signing_config[0]`                    |
|        | `aws_lambda_event_source_mapping.audit_logs`                                      |
|        | `aws_lambda_event_source_mapping.reliability`                                     |
|        | `aws_lambda_event_source_mapping.reprocess_submission`                            |
|        | `aws_lambda_event_source_mapping.vault_updated_item_stream`                       |
|        | `aws_lambda_function.audit_logs`                                                  |
|        | `aws_lambda_function.form_archiver`                                               |
|        | `aws_lambda_function.nagware`                                                     |
|        | `aws_lambda_function.reliability`                                                 |
|        | `aws_lambda_function.reliability_dlq_consumer`                                    |
|        | `aws_lambda_function.response_archiver`                                           |
|        | `aws_lambda_function.submission`                                                  |
|        | `aws_lambda_function.vault_integrity`                                             |
|        | `aws_lambda_permission.allow_cloudwatch_to_run_archive_form_responses_lambda`     |
|        | `aws_lambda_permission.allow_cloudwatch_to_run_dead_letter_queue_consumer_lambda` |
|        | `aws_lambda_permission.allow_cloudwatch_to_run_form_archiver_lambda`              |
|        | `aws_lambda_permission.allow_cloudwatch_to_run_nagware_lambda`                    |
|        | `aws_lambda_permission.submission`                                                |
|        | `aws_s3_object.audit_logs_code`                                                   |
|        | `aws_s3_object.form_archiver_code`                                                |
|        | `aws_s3_object.nagware_code`                                                      |
|        | `aws_s3_object.reliability_code`                                                  |
|        | `aws_s3_object.reliability_dlq_consumer_code`                                     |
|        | `aws_s3_object.response_archiver_code`                                            |
|        | `aws_s3_object.submission_code`                                                   |
|        | `aws_s3_object.vault_integrity_code`                                              |
|        | `aws_signer_signing_job.vault_integrity[0]`                                       |
|        | `aws_signer_signing_profile.lambda_signing_profile[0]`                            |


</details>


**✂ &nbsp; Warning:** plan has been truncated! See the [full plan in the logs](https://github.com/cds-snc/forms-terraform/actions/runs/7617084619).
<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_cloudwatch_event_rule.cron_2am_every_day will be created
  + resource "aws_cloudwatch_event_rule" "cron_2am_every_day" {
      + arn                 = (known after apply)
      + description         = "Fires every day at 2am EST"
      + event_bus_name      = "default"
      + id                  = (known after apply)
      + name                = "every-day-at-2am"
      + name_prefix         = (known after apply)
      + schedule_expression = "cron(0 7 * * ? *)"
      + tags_all            = {
          + "CostCentre" = "forms-platform-production"
          + "Terraform"  = "true"
        }
    }

  # aws_cloudwatch_event_rule.cron_3am_every_day will be created
  + resource "aws_cloudwatch_event_rule" "cron_3am_every_day" {
      + arn                 = (known after apply)
      + description         = "Fires every day at 3am EST"
      + event_bus_name      = "default"
      + id                  = (known after apply)
      + name                = "every-day-at-3am"
      + name_prefix         = (known after apply)
      + schedule_expression = "cron(0 8 * * ? *)"
      + tags_all            = {
          + "CostCentre" = "forms-platform-production"
          + "Terraform"  = "true"
        }
    }

  # aws_cloudwatch_event_rule.cron_4am_every_day will be created
  + resource "aws_cloudwatch_event_rule" "cron_4am_every_day" {
      + arn                 = (known after apply)
      + description         = "Fires every day at 4am EST"
      + event_bus_name      = "default"
      + id                  = (known after apply)
      + name                = "every-day-at-4am"
      + name_prefix         = (known after apply)
      + schedule_expression = "cron(0 9 * * ? *)"
      + tags_all            = {
          + "CostCentre" = "forms-platform-production"
          + "Terraform"  = "true"
        }
    }

  # aws_cloudwatch_event_rule.cron_5am_every_business_day will be created
  + resource "aws_cloudwatch_event_rule" "cron_5am_every_business_day" {
      + arn                 = (known after apply)
      + description         = "Fires every business day at 5am EST"
      + event_bus_name      = "default"
      + id                  = (known after apply)
      + name                = "every-business-day-at-5am"
      + name_prefix         = (known after apply)
      + schedule_expression = "cron(0 10 ? * MON-FRI *)"
      + tags_all            = {
          + "CostCentre" = "forms-platform-production"
          + "Terraform"  = "true"
        }
    }

  # aws_cloudwatch_event_target.run_archive_form_responses_lambda_every_day will be created
  + resource "aws_cloudwatch_event_target" "run_archive_form_responses_lambda_every_day" {
      + arn            = (known after apply)
      + event_bus_name = "default"
      + id             = (known after apply)
      + rule           = "every-day-at-3am"
      + target_id      = (known after apply)
    }

  # aws_cloudwatch_event_target.run_archive_form_templates_lambda_every_day will be created
  + resource "aws_cloudwatch_event_target" "run_archive_form_templates_lambda_every_day" {
      + arn            = (known after apply)
      + event_bus_name = "default"
      + id             = (known after apply)
      + rule           = "every-day-at-4am"
      + target_id      = (known after apply)
    }

  # aws_cloudwatch_event_target.run_dead_letter_queue_consumer_lambda_every_day will be created
  + resource "aws_cloudwatch_event_target" "run_dead_letter_queue_consumer_lambda_every_day" {
      + arn            = (known after apply)
      + event_bus_name = "default"
      + id             = (known after apply)
      + rule           = "every-day-at-2am"
      + target_id      = (known after apply)
    }

  # aws_cloudwatch_event_target.run_nagware_lambda_every_day will be created
  + resource "aws_cloudwatch_event_target" "run_nagware_lambda_every_day" {
      + arn            = (known after apply)
      + event_bus_name = "default"
      + id             = (known after apply)
      + rule           = "every-business-day-at-5am"
      + target_id      = (known after apply)
    }

  # aws_cloudwatch_log_group.archive_form_templates will be created
  + resource "aws_cloudwatch_log_group" "archive_form_templates" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + kms_key_id        = "arn:aws:kms:ca-central-1:957818836222:key/b5973af1-3114-4808-9455-57441c35854d"
      + log_group_class   = (known after apply)
      + name              = "/aws/lambda/Archive_Form_Templates"
      + name_prefix       = (known after apply)
      + retention_in_days = 731
      + skip_destroy      = false
      + tags_all          = {
          + "CostCentre" = "forms-platform-production"
          + "Terraform"  = "true"
        }
    }

  # aws_cloudwatch_log_group.audit_logs will be created
  + resource "aws_cloudwatch_log_group" "audit_logs" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + kms_key_id        = "arn:aws:kms:ca-central-1:957818836222:key/b5973af1-3114-4808-9455-57441c35854d"
      + log_group_class   = (known after apply)
      + name              = "/aws/lambda/Audit_Logs"
      + name_prefix       = (known after apply)
      + retention_in_days = 731
      + skip_destroy      = false
      + tags_all          = {
          + "CostCentre" = "forms-platform-production"
          + "Terraform"  = "true"
        }
    }

  # aws_cloudwatch_log_group.dead_letter_queue_consumer will be created
  + resource "aws_cloudwatch_log_group" "dead_letter_queue_consumer" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + kms_key_id        = "arn:aws:kms:ca-central-1:957818836222:key/b5973af1-3114-4808-9455-57441c35854d"
      + log_group_class   = (known after apply)
      + name              = "/aws/lambda/Reliability_DLQ_Consumer"
      + name_prefix       = (known after apply)
      + retention_in_days = 731
      + skip_destroy      = false
      + tags_all          = {
          + "CostCentre" = "forms-platform-production"
          + "Terraform"  = "true"
        }
    }

  # aws_cloudwatch_log_group.nagware will be created
  + resource "aws_cloudwatch_log_group" "nagware" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + kms_key_id        = "arn:aws:kms:ca-central-1:957818836222:key/b5973af1-3114-4808-9455-57441c35854d"
      + log_group_class   = (known after apply)
      + name              = "/aws/lambda/Nagware"
      + name_prefix       = (known after apply)
      + retention_in_days = 731
      + skip_destroy      = false
      + tags_all          = {
          + "CostCentre" = "forms-platform-production"
          + "Terraform"  = "true"
        }
    }

  # aws_cloudwatch_log_group.reliability will be created
  + resource "aws_cloudwatch_log_group" "reliability" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + kms_key_id        = "arn:aws:kms:ca-central-1:957818836222:key/b5973af1-3114-4808-9455-57441c35854d"
      + log_group_class   = (known after apply)
      + name              = "/aws/lambda/Reliability"
      + name_prefix       = (known after apply)
      + retention_in_days = 731
      + skip_destroy      = false
      + tags_all          = {
          + "CostCentre" = "forms-platform-production"
          + "Terraform"  = "true"
        }
    }

  # aws_cloudwatch_log_group.response_archiver will be created
  + resource "aws_cloudwatch_log_group" "response_archiver" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + kms_key_id        = "arn:aws:kms:ca-central-1:957818836222:key/b5973af1-3114-4808-9455-57441c35854d"
      + log_group_class   = (known after apply)
      + name              = "/aws/lambda/Response_Archiver"
      + name_prefix       = (known after apply)
      + retention_in_days = 731
      + skip_destroy      = false
      + tags_all          = {
          + "CostCentre" = "forms-platform-production"
          + "Terraform"  = "true"
        }
    }

  # aws_cloudwatch_log_group.submission will be created
  + resource "aws_cloudwatch_log_group" "submission" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + kms_key_id        = "arn:aws:kms:ca-central-1:957818836222:key/b5973af1-3114-4808-9455-57441c35854d"
      + log_group_class   = (known after apply)
      + name              = "/aws/lambda/Submission"
      + name_prefix       = (known after apply)
      + retention_in_days = 731
      + skip_destroy      = false
      + tags_all          = {
          + "CostCentre" = "forms-platform-production"
          + "Terraform"  = "true"
        }
    }

  # aws_cloudwatch_log_group.vault_integrity will be created
  + resource "aws_cloudwatch_log_group" "vault_integrity" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + kms_key_id        = "arn:aws:kms:ca-central-1:957818836222:key/b5973af1-3114-4808-9455-57441c35854d"
      + log_group_class   = (known after apply)
      + name              = "/aws/lambda/Vault_Data_Integrity_Check"
      + name_prefix       = (known after apply)
      + retention_in_days = 731
      + skip_destroy      = false
      + tags_all          = {
          + "CostCentre" = "forms-platform-production"
          + "Terraform"  = "true"
        }
    }

  # aws_iam_policy.lambda_dynamodb will be created
  + resource "aws_iam_policy" "lambda_dynamodb" {
      + arn         = (known after apply)
      + description = "IAM policy for storing Form responses in DynamoDB"
      + id          = (known after apply)
      + name        = "lambda_dynamobdb"
      + name_prefix = (known after apply)
      + path        = "/"
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "dynamodb:UpdateItem",
                          + "dynamodb:Scan",
                          + "dynamodb:Query",
                          + "dynamodb:PutItem",
                          + "dynamodb:ListStreams",
                          + "dynamodb:GetShardIterator",
                          + "dynamodb:GetRecords",
                          + "dynamodb:GetItem",
                          + "dynamodb:DescribeStream",
                          + "dynamodb:DeleteItem",
                          + "dynamodb:BatchWriteItem",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:dynamodb:ca-central-1:957818836222:table/Vault/index/*",
                          + "arn:aws:dynamodb:ca-central-1:957818836222:table/Vault",
                          + "arn:aws:dynamodb:ca-central-1:957818836222:table/ReliabilityQueue",
                          + "arn:aws:dynamodb:ca-central-1:957818836222:table/AuditLogs/index/*",
                          + "arn:aws:dynamodb:ca-central-1:957818836222:table/AuditLogs",
                          + "arn:aws:dynamodb:ca-central-1:123456789012:table/Vault/stream/2023-03-14T15:54:31.086",
                        ]
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id   = (known after apply)
      + tags_all    = {
          + "CostCentre" = "forms-platform-production"
          + "Terraform"  = "true"
        }
    }

  # aws_iam_policy.lambda_kms will be created
  + resource "aws_iam_policy" "lambda_kms" {
      + arn         = (known after apply)
      + description = "IAM policy for storing encrypting and decrypting data"
      + id          = (known after apply)
      + name        = "lambda_kms"
      + name_prefix = (known after apply)
      + path        = "/"
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "kms:GenerateDataKey",
                          + "kms:Encrypt",
                          + "kms:Decrypt",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:kms:ca-central-1:957818836222:key/b5973af1-3114-4808-9455-57441c35854d",
                          + "arn:aws:kms:ca-central-1:957818836222:key/afbaea67-8277-4a4c-853e-7697dd2dade5",
                        ]
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id   = (known after apply)
      + tags_all    = {
          + "CostCentre" = "forms-platform-production"
          + "Terraform"  = "true"
        }
    }

  # aws_iam_policy.lambda_logging will be created
  + resource "aws_iam_policy" "lambda_logging" {
      + arn         = (known after apply)
      + description = "IAM policy for logging from a lambda"
      + id          = (known after apply)
      + name        = "lambda_logging"
      + name_prefix = (known after apply)
      + path        = "/"
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "logs:PutLogEvents",
                          + "logs:CreateLogStream",
                          + "logs:CreateLogGroup",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:logs:*:*:*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id   = (known after apply)
      + tags_all    = {
          + "CostCentre" = "forms-platform-production"
          + "Terraform"  = "true"
        }
    }

  # aws_iam_policy.lambda_rds will be created
  + resource "aws_iam_policy" "lambda_rds" {
      + arn         = (known after apply)
      + description = "IAM policy for allowing acces to DB"
      + id          = (known after apply)
      + name        = "lambda_rds"
      + name_prefix = (known after apply)
      + path        = "/"
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "tag:GetResources",
                          + "secretsmanager:CreateSecret",
                          + "rds-data:RollbackTransaction",
                          + "rds-data:ExecuteStatement",
                          + "rds-data:ExecuteSql",
                          + "rds-data:CommitTransaction",
                          + "rds-data:BeginTransaction",
                          + "rds-data:BatchExecuteStatement",
                          + "dbqms:UpdateQueryHistory",
                          + "dbqms:UpdateFavoriteQuery",
                          + "dbqms:GetQueryString",
                          + "dbqms:DescribeQueryHistory",
                          + "dbqms:DescribeFavoriteQueries",
                          + "dbqms:DeleteQueryHistory",
                          + "dbqms:DeleteFavoriteQueries",
                          + "dbqms:CreateQueryHistory",
                          + "dbqms:CreateFavoriteQuery",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = "RDSDataServiceAccess"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id   = (known after apply)
      + tags_all    = {
          + "CostCentre" = "forms-platform-production"
          + "Terraform"  = "true"
        }
    }

  # aws_iam_policy.lambda_s3 will be created
  + resource "aws_iam_policy" "lambda_s3" {
      + arn         = (known after apply)
      + description = "IAM policy for storing files in S3"
      + id          = (known after apply)
      + name        = "lambda_s3"
      + name_prefix = (known after apply)
      + path        = "/"
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "s3:PutObject",
                          + "s3:ListBucket",
                          + "s3:GetObject",
                          + "s3:DeleteObject",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:s3:::forms-staging-vault-file-storage/*",
                          + "arn:aws:s3:::forms-staging-vault-file-storage",
                          + "arn:aws:s3:::forms-staging-reliability-file-storage/*",
                          + "arn:aws:s3:::forms-staging-reliability-file-storage",
                          + "arn:aws:s3:::forms-staging-lambda-code/*",
                          + "arn:aws:s3:::forms-staging-lambda-code",
                          + "arn:aws:s3:::forms-staging-archive-storage/*",
                          + "arn:aws:s3:::forms-staging-archive-storage",
                        ]
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id   = (known after apply)
      + tags_all    = {
          + "CostCentre" = "forms-platform-production"
          + "Terraform"  = "true"
        }
    }

  # aws_iam_policy.lambda_secrets will be created
  + resource "aws_iam_policy" "lambda_secrets" {
      + arn         = (known after apply)
      + description = "IAM policy for accessing secret manager"
      + id          = (known after apply)
      + name        = "lambda_secrets"
      + name_prefix = (known after apply)
      + path        = "/"
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = "secretsmanager:GetSecretValue"
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:secretsmanager:ca-central-1:957818836222:secret:database-secret-RThElE",
                          + "arn:aws:secretsmanager:ca-central-1:123456789012:secret:notify_api_key",
                        ]
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id   = (known after apply)
      + tags_all    = {
          + "CostCentre" = "forms-platform-production"
          + "Terraform"  = "true"
        }
    }

  # aws_iam_policy.lambda_sns will be created
  + resource "aws_iam_policy" "lambda_sns" {
      + arn         = (known after apply)
      + description = "IAM policy for allowing lambda to publish message in SNS for Slack notification"
      + id          = (known after apply)
      + name        = "lambda_sns"
      + name_prefix = (known after apply)
      + path        = "/"
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = "sns:Publish"
                      + Effect   = "Allow"
                      + Resource = "arn:aws:sns:ca-central-1:957818836222:alert-critical"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id   = (known after apply)
      + tags_all    = {
          + "CostCentre" = "forms-platform-production"
          + "Terraform"  = "true"
        }
    }

  # aws_iam_policy.lambda_sqs will be created
  + resource "aws_iam_policy" "lambda_sqs" {
      + arn         = (known after apply)
      + description = "IAM policy for sending messages through SQS"
      + id          = (known after apply)
      + name        = "lambda_sqs"
      + name_prefix = (known after apply)
      + path        = "/"
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "sqs:SendMessage",
                          + "sqs:ReceiveMessage",
                          + "sqs:GetQueueAttributes",
                          + "sqs:DeleteMessage",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:sqs:*:*:*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id   = (known after apply)
      + tags_all    = {
          + "CostCentre" = "forms-platform-production"
          + "Terraform"  = "true"
        }
    }

  # aws_iam_role.lambda will be created
  + resource "aws_iam_role" "lambda" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "iam_for_lambda"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = {
          + "CostCentre" = "forms-platform-production"
          + "Terraform"  = "true"
        }
      + unique_id             = (known after apply)
    }

  # aws_iam_role_policy_attachment.AWSLambdaVPCAccessExecutionRole will be created
  + resource "aws_iam_role_policy_attachment" "AWSLambdaVPCAccessExecutionRole" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/service-role/AWSLambdaVPCAccessExecutionRole"
      + role       = "iam_for_lambda"
    }

  # aws_iam_role_policy_attachment.lambda_dynamodb will be created
  + resource "aws_iam_role_policy_attachment" "lambda_dynamodb" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "iam_for_lambda"
    }

  # aws_iam_role_policy_attachment.lambda_kms will be created
  + resource "aws_iam_role_policy_attachment" "lambda_kms" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "iam_for_lambda"
    }

  # aws_iam_role_policy_attachment.lambda_logs will be created
  + resource "aws_iam_role_policy_attachment" "lambda_logs" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "iam_for_lambda"
    }

  # aws_iam_role_policy_attachment.lambda_rds will be created
  + resource "aws_iam_role_policy_attachment" "lambda_rds" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "iam_for_lambda"
    }

  # aws_iam_role_policy_attachment.lambda_s3 will be created
  + resource "aws_iam_role_policy_attachment" "lambda_s3" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "iam_for_lambda"
    }

  # aws_iam_role_policy_attachment.lambda_secrets will be created
  + resource "aws_iam_role_policy_attachment" "lambda_secrets" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "iam_for_lambda"
    }

  # aws_iam_role_policy_attachment.lambda_sns will be created
  + resource "aws_iam_role_policy_attachment" "lambda_sns" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "iam_for_lambda"
    }

  # aws_iam_role_policy_attachment.lambda_sqs will be created
  + resource "aws_iam_role_policy_attachment" "lambda_sqs" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "iam_for_lambda"
    }

  # aws_lambda_code_signing_config.lambda_code_signing_config[0] will be created
  + resource "aws_lambda_code_signing_config" "lambda_code_signing_config" {
      + arn           = (known after apply)
      + config_id     = (known after apply)
      + id            = (known after apply)
      + last_modified = (known after apply)

      + allowed_publishers {
          + signing_profile_version_arns = (known after apply)
        }

      + policies {
          + untrusted_artifact_on_deployment = "Enforce"
        }
    }

  # aws_lambda_event_source_mapping.audit_logs will be created
  + resource "aws_lambda_event_source_mapping" "audit_logs" {
      + batch_size                         = 10
      + enabled                            = true
      + event_source_arn                   = "arn:aws:sqs:ca-central-1:957818836222:audit_log_queue"
      + function_arn                       = (known after apply)
      + function_name                      = (known after apply)
      + function_response_types            = [
          + "ReportBatchItemFailures",
        ]
      + id                                 = (known after apply)
      + last_modified                      = (known after apply)
      + last_processing_result             = (known after apply)
      + maximum_batching_window_in_seconds = 30
      + maximum_record_age_in_seconds      = (known after apply)
      + maximum_retry_attempts             = (known after apply)
      + parallelization_factor             = (known after apply)
      + state                              = (known after apply)
      + state_transition_reason            = (known after apply)
      + uuid                               = (known after apply)
    }

  # aws_lambda_event_source_mapping.reliability will be created
  + resource "aws_lambda_event_source_mapping" "reliability" {
      + batch_size                    = 1
      + enabled                       = true
      + event_source_arn              = "arn:aws:sqs:ca-central-1:957818836222:submission_processing.fifo"
      + function_arn                  = (known after apply)
      + function_name                 = (known after apply)
      + id                            = (known after apply)
      + last_modified                 = (known after apply)
      + last_processing_result        = (known after apply)
      + maximum_record_age_in_seconds = (known after apply)
      + maximum_retry_attempts        = (known after apply)
      + parallelization_factor        = (known after apply)
      + state                         = (known after apply)
      + state_transition_reason       = (known after apply)
      + uuid                          = (known after apply)
    }

  # aws_lambda_event_source_mapping.reprocess_submission will be created
  + resource "aws_lambda_event_source_mapping" "reprocess_submission" {
      + batch_size                    = 1
      + enabled                       = true
      + event_source_arn              = "arn:aws:sqs:ca-central-1:957818836222:reprocess_submission_queue.fifo"
      + function_arn                  = (known after apply)
      + function_name                 = (known after apply)
      + id                            = (known after apply)
      + last_modified                 = (known after apply)
      + last_processing_result        = (known after apply)
      + maximum_record_age_in_seconds = (known after apply)
      + maximum_retry_attempts        = (known after apply)
      + parallelization_factor        = (known after apply)
      + state                         = (known after apply)
      + state_transition_reason       = (known after apply)
      + uuid                          = (known after apply)
    }

  # aws_lambda_event_source_mapping.vault_updated_item_stream will be created
  + resource "aws_lambda_event_source_mapping" "vault_updated_item_stream" {
      + enabled                            = true
      + event_source_arn                   = "arn:aws:dynamodb:ca-central-1:123456789012:table/Vault/stream/2023-03-14T15:54:31.086"
      + function_arn                       = (known after apply)
      + function_name                      = (known after apply)
      + id                                 = (known after apply)
      + last_modified                      = (known after apply)
      + last_processing_result             = (known after apply)
      + maximum_batching_window_in_seconds = 60
      + maximum_record_age_in_seconds      = (known after apply)
      + maximum_retry_attempts             = 3
      + parallelization_factor             = (known after apply)
      + starting_position                  = "LATEST"
      + state                              = (known after apply)
      + state_transition_reason            = (known after apply)
      + uuid                               = (known after apply)

      + filter_criteria {
          + filter {
              + pattern = jsonencode(
                    {
                      + eventName = [
                          + "INSERT",
                          + "MODIFY",
                        ]
                    }
                )
            }
        }
    }

  # aws_lambda_function.audit_logs will be created
  + resource "aws_lambda_function" "audit_logs" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + function_name                  = "Audit_Logs"
      + handler                        = "audit_logs.handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 128
      + package_type ...
```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_event_rule.cron_2am_every_day"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_event_rule.cron_3am_every_day"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_event_rule.cron_4am_every_day"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_event_rule.cron_5am_every_business_day"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.archive_form_templates"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.audit_logs"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.dead_letter_queue_consumer"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.nagware"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.reliability"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.response_archiver"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.submission"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.vault_integrity"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.lambda_dynamodb"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.lambda_kms"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.lambda_logging"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.lambda_rds"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.lambda_s3"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.lambda_secrets"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.lambda_sns"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.lambda_sqs"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_role.lambda"]
WARN - plan.json - main - Missing Common Tags: ["aws_lambda_function.audit_logs"]
WARN - plan.json - main - Missing Common Tags: ["aws_lambda_function.form_archiver"]
WARN -...
```

</details>
